# 10.1 GroupBy framework

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({"key1": ["a", "a", None, "b", "b", "a", None],
                   "key2": pd.Series([1, 2, 1, 2, 1, None, 1], dtype="Int64"),
                   "data1": np.random.standard_normal(7),
                   "data2": np.random.standard_normal(7)})

In [3]:
df

   key1  key2     data1     data2
0     a     1 -0.228424  0.083185
1     a     2 -0.235741 -0.798157
2  None     1 -3.136927 -0.214111
3     b     2  0.156794 -1.104649
4     b     1  0.604904  2.107200
5     a  <NA>  0.548875  2.904673
6  None     1  0.577205  0.003356

In [4]:
grouped = df["data1"].groupby(df["key1"])

In [5]:
grouped

In [6]:
grouped.mean()

key1
a    0.028236
b    0.380849
Name: data1, dtype: float64

In [7]:
means = df["data1"].groupby([df["key1"], df["key2"]]).mean()

In [8]:
means

key1  key2
a     1      -0.228424
      2      -0.235741
b     1       0.604904
      2       0.156794
Name: data1, dtype: float64

In [9]:
means.unstack()

key2         1         2
key1
a    -0.228424 -0.235741
b     0.604904  0.156794

In [10]:
states = np.array(["OH", "CA", "CA", "OH", "OH", "CA", "OH"])

In [11]:
years = [2005, 2005, 2006, 2005, 2006, 2005, 2006]

In [12]:
df["data1"].groupby([states, years]).mean()

CA  2005    0.156567
    2006   -3.136927
OH  2005   -0.035815
    2006    0.591054
Name: data1, dtype: float64

In [13]:
df.groupby("key1").mean()

      key2     data1     data2
key1
a      1.5  0.028236  0.729900
b      1.5  0.380849  0.501276

In [14]:
df.groupby(["key1", "key2"]).mean()

              data1     data2
key1 key2
a    1    -0.228424  0.083185
     2    -0.235741 -0.798157
b    1     0.604904  2.107200
     2     0.156794 -1.104649

In [15]:
df.groupby(["key1", "key2"]).size()

key1  key2
a     1       1
      2       1
b     1       1
      2       1
dtype: int64

In [16]:
df.groupby("key1", dropna=False).size()

key1
a      3
b      2
NaN    2
dtype: int64

In [17]:
df.groupby(["key1", "key2"], dropna=False).size()

key1  key2
a     1       1
      2       1
      <NA>    1
b     1       1
      2       1
NaN   1       2
dtype: int64

In [18]:
df.groupby("key1").count()

      key2  data1  data2
key1
a        2      3      3
b        2      2      2

In [19]:
df.groupby("key2").count()

      key1  data1  data2
key2
1        2      4      4
2        2      2      2

# 10.1.1 iterate on grouping

In [20]:
for name, group in df.groupby("key1"):
    print(name)
    print(group)

a
  key1  key2     data1     data2
0    a     1 -0.228424  0.083185
1    a     2 -0.235741 -0.798157
5    a  <NA>  0.548875  2.904673
b
  key1  key2     data1     data2
3    b     2  0.156794 -1.104649
4    b     1  0.604904  2.107200

In [21]:
for (k1, k2), group in df.groupby(["key1", "key2"]):
    print((k1, k2))
    print(group)

('a', np.int64(1))
  key1  key2     data1     data2
0    a     1 -0.228424  0.083185
('a', np.int64(2))
  key1  key2     data1     data2
1    a     2 -0.235741 -0.798157
('b', np.int64(1))
  key1  key2     data1   data2
4    b     1  0.604904  2.1072
('b', np.int64(2))
  key1  key2     data1     data2
3    b     2  0.156794 -1.104649

In [22]:
pieces = {name: group for name, group in df.groupby("key1")}

In [23]:
pieces["b"]

  key1  key2     data1     data2
3    b     2  0.156794 -1.104649
4    b     1  0.604904  2.107200

In [24]:
grouped = df.groupby({"key1": "key", "key2": "key",
                      "data1": "data", "data2": "data"}, axis="columns")

/tmp/ipykernel_4792/1884927282.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  grouped = df.groupby({"key1": "key", "key2": "key",

In [25]:
for group_key, group_values in grouped:
    print(group_key)
    print(group_values)

data
      data1     data2
0 -0.228424  0.083185
1 -0.235741 -0.798157
2 -3.136927 -0.214111
3  0.156794 -1.104649
4  0.604904  2.107200
5  0.548875  2.904673
6  0.577205  0.003356
key
   key1  key2
0     a     1
1     a     2
2  None     1
3     b     2
4     b     1
5     a  <NA>
6  None     1

# 10.1.2 select one or more columns

In [26]:
df.groupby(["key1", "key2"])[["data2"]].mean()

              data2
key1 key2
a    1     0.083185
     2    -0.798157
b    1     2.107200
     2    -1.104649

In [27]:
s_grouped = df.groupby(["key1", "key2"])["data2"]

In [28]:
s_grouped

In [29]:
s_grouped.mean()

key1  key2
a     1       0.083185
      2      -0.798157
b     1       2.107200
      2      -1.104649
Name: data2, dtype: float64

# 10.1.3 grouping using dictionaries and series

In [30]:
people = pd.DataFrame(np.random.standard_normal((5, 5)),
                      columns=["a", "b", "c", "d", "e"],
                      index=["Joe", "Steve", "Wanda", "Jill", "Trey"])

In [31]:
people.iloc[2:3, [1, 2]] = np.nan #join some none

In [32]:
people

              a         b         c         d         e
Joe    0.958666 -0.712639 -1.389514  0.166889 -0.370181
Steve  2.273955  2.251519  0.250496  0.179048 -0.016515
Wanda  0.989129       NaN       NaN -2.128349  0.174824
Jill  -0.153105  1.573400 -0.781241  1.039936  0.130231
Trey  -0.825296  1.046822 -1.007199 -0.420073  0.578486

In [33]:
mapping = {"a": "red", "b": "red", "c": "blue",
           "d": "blue", "e": "red", "f": "orange"}

In [34]:
by_column = people.groupby(mapping, axis="columns")

/tmp/ipykernel_4792/2536829432.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  by_column = people.groupby(mapping, axis="columns")

In [35]:
by_column.sum()

           blue       red
Joe   -1.222624 -0.124154
Steve  0.429544  4.508959
Wanda -2.128349  1.163953
Jill   0.258696  1.550527
Trey  -1.427272  0.800012

In [36]:
map_series = pd.Series(mapping)

In [37]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [38]:
people.groupby(map_series, axis="columns").count()

/tmp/ipykernel_4792/2727320543.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  people.groupby(map_series, axis="columns").count()

       blue  red
Joe       2    3
Steve     2    3
Wanda     1    2
Jill      2    3
Trey      2    3

# 10.1.4 grouping using functions

In [39]:
people.groupby(len).sum()

          a         b         c         d         e
3  0.958666 -0.712639 -1.389514  0.166889 -0.370181
4 -0.978400  2.620222 -1.788440  0.619863  0.708717
5  3.263084  2.251519  0.250496 -1.949301  0.158310

In [40]:
key_list = ["one", "one", "one", "two", "two"]

In [41]:
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one  0.958666 -0.712639 -1.389514  0.166889 -0.370181
4 two -0.825296  1.046822 -1.007199 -0.420073  0.130231
5 one  0.989129  2.251519  0.250496 -2.128349 -0.016515

# 10.1.5 grouping according to index level

In [42]:
columns = pd.MultiIndex.from_arrays([["US", "US", "US", "JP", "JP"],
                                     [1, 3, 5, 1, 3]],
                                    names=["cty", "tenor"])

In [43]:
hier_df = pd.DataFrame(np.random.standard_normal((4, 5)), columns=columns)

In [44]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      0.517616 -0.204160  1.992018  0.578147 -1.485600
1     -0.135837  0.270678  1.262209 -0.299038  0.129668
2      0.701816 -0.177961 -0.469877  0.605792 -0.576913
3     -1.006112 -0.532294  1.013014  0.680974 -1.490569

In [45]:
hier_df.groupby(level="cty", axis="columns").count()

/tmp/ipykernel_4792/2795167867.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  hier_df.groupby(level="cty", axis="columns").count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

# 10.2 data aggregation

In [46]:
df

   key1  key2     data1     data2
0     a     1 -0.228424  0.083185
1     a     2 -0.235741 -0.798157
2  None     1 -3.136927 -0.214111
3     b     2  0.156794 -1.104649
4     b     1  0.604904  2.107200
5     a  <NA>  0.548875  2.904673
6  None     1  0.577205  0.003356

In [47]:
grouped = df.groupby("key1")

In [48]:
grouped["data1"].nsmallest(2)

key1
a     1   -0.235741
      0   -0.228424
b     3    0.156794
      4    0.604904
Name: data1, dtype: float64

In [49]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

In [50]:
grouped.agg(peak_to_peak)

      key2     data1     data2
key1
a        1  0.784616  3.702830
b        1  0.448110  3.211849

In [51]:
grouped.describe()

      key2                                           data1            ...  \
     count mean       std  min   25%  50%   75%  max count      mean  ...
key1                                                                  ...
a      2.0  1.5  0.707107  1.0  1.25  1.5  1.75  2.0   3.0  0.028236  ...
b      2.0  1.5  0.707107  1.0  1.25  1.5  1.75  2.0   2.0  0.380849  ...

                         data2                                          \
           75%       max count      mean       std       min       25%
key1
a     0.160225  0.548875   3.0  0.729900  1.934274 -0.798157 -0.357486
b     0.492877  0.604904   2.0  0.501276  2.271120 -1.104649 -0.301686


           50%       75%       max
key1
a     0.083185  1.493929  2.904673
b     0.501276  1.304238  2.107200

[2 rows x 24 columns]

# 10.2.1 column by column operations and multi function applications

In [52]:
tips = pd.read_csv("examples/tips.csv")

In [53]:
tips.head()

   total_bill   tip smoker  day    time  size
0       16.99  1.01     No  Sun  Dinner     2
1       10.34  1.66     No  Sun  Dinner     3
2       21.01  3.50     No  Sun  Dinner     3
3       23.68  3.31     No  Sun  Dinner     2
4       24.59  3.61     No  Sun  Dinner     4

In [54]:
tips["tip_pct"] = tips["tip"] / tips["total_bill"]

In [55]:
tips.head()

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808

In [56]:
grouped = tips.groupby(["day", "smoker"])

In [57]:
grouped_pct = grouped["tip_pct"]

In [58]:
grouped_pct.agg("mean")

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [59]:
grouped_pct.agg(["mean", "std", peak_to_peak])

                 mean       std  peak_to_peak
day  smoker
Fri  No      0.151650  0.028123      0.067349
     Yes     0.174783  0.051293      0.159925
Sat  No      0.158048  0.039767      0.235193
     Yes     0.147906  0.061375      0.290095
Sun  No      0.160113  0.042347      0.193226
     Yes     0.187250  0.154134      0.644685
Thur No      0.160298  0.038774      0.193350
     Yes     0.163863  0.039389      0.151240

In [60]:
grouped_pct.agg([("average", "mean"), ("stdev", np.std)])

/tmp/ipykernel_4792/1734782830.py:1: FutureWarning: The provided callable <function std at 0x7bd1104a2050> is currently using SeriesGroupBy.std. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "std" instead.
  grouped_pct.agg([("average", "mean"), ("stdev", np.std)])

              average     stdev
day  smoker
Fri  No      0.151650  0.028123
     Yes     0.174783  0.051293
Sat  No      0.158048  0.039767
     Yes     0.147906  0.061375
Sun  No      0.160113  0.042347
     Yes     0.187250  0.154134
Thur No      0.160298  0.038774
     Yes     0.163863  0.039389

In [61]:
functions = ["count", "mean", "max"]

In [62]:
result = grouped[["tip_pct", "total_bill"]].agg(functions)

In [63]:
result

            tip_pct                     total_bill
              count      mean       max      count       mean    max
day  smoker
Fri  No           4  0.151650  0.187735          4  18.420000  22.75
     Yes         15  0.174783  0.263480         15  16.813333  40.17
Sat  No          45  0.158048  0.291990         45  19.661778  48.33
     Yes         42  0.147906  0.325733         42  21.276667  50.81
Sun  No          57  0.160113  0.252672         57  20.506667  48.17
     Yes         19  0.187250  0.710345         19  24.120000  45.35
Thur No          45  0.160298  0.266312         45  17.113111  41.19
     Yes         17  0.163863  0.241255         17  19.190588  43.11

In [64]:
result["tip_pct"]

             count      mean       max
day  smoker
Fri  No          4  0.151650  0.187735
     Yes        15  0.174783  0.263480
Sat  No         45  0.158048  0.291990
     Yes        42  0.147906  0.325733
Sun  No         57  0.160113  0.252672
     Yes        19  0.187250  0.710345
Thur No         45  0.160298  0.266312
     Yes        17  0.163863  0.241255

In [65]:
ftuples = [("Average", "mean"), ("Variance", np.var)]

In [66]:
grouped[["tip_pct", "total_bill"]].agg(ftuples)

/tmp/ipykernel_4792/365474927.py:1: FutureWarning: The provided callable <function var at 0x7bd1104a2170> is currently using SeriesGroupBy.var. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "var" instead.
  grouped[["tip_pct", "total_bill"]].agg(ftuples)

              tip_pct           total_bill
              Average  Variance    Average    Variance
day  smoker
Fri  No      0.151650  0.000791  18.420000   25.596333
     Yes     0.174783  0.002631  16.813333   82.562438
Sat  No      0.158048  0.001581  19.661778   79.908965
     Yes     0.147906  0.003767  21.276667  101.387535
Sun  No      0.160113  0.001793  20.506667   66.099980
     Yes     0.187250  0.023757  24.120000  109.046044
Thur No      0.160298  0.001503  17.113111   59.625081
     Yes     0.163863  0.001551  19.190588   69.808518

In [67]:
grouped.agg({"tip": np.max, "size": "sum"})

/tmp/ipykernel_4792/3453032214.py:1: FutureWarning: The provided callable <function max at 0x7bd1104a1630> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  grouped.agg({"tip": np.max, "size": "sum"})

               tip  size
day  smoker
Fri  No       3.50     9
     Yes      4.73    31
Sat  No       9.00   115
     Yes     10.00   104
Sun  No       6.00   167
     Yes      6.50    49
Thur No       6.70   112
     Yes      5.00    40

In [68]:
grouped.agg({"tip_pct": ["min", "max", "mean", "std"],
             "size": "sum"})

              tip_pct                               size
                  min       max      mean       std  sum
day  smoker
Fri  No      0.120385  0.187735  0.151650  0.028123    9
     Yes     0.103555  0.263480  0.174783  0.051293   31
Sat  No      0.056797  0.291990  0.158048  0.039767  115
     Yes     0.035638  0.325733  0.147906  0.061375  104
Sun  No      0.059447  0.252672  0.160113  0.042347  167
     Yes     0.065660  0.710345  0.187250  0.154134   49
Thur No      0.072961  0.266312  0.160298  0.038774  112
     Yes     0.090014  0.241255  0.163863  0.039389   40

# 10.2.2 return aggregated data without row index

In [69]:
# tips.groupby(["day", "smoker"], as_index=False).mean()

In [70]:
tips.any()

total_bill    True
tip           True
smoker        True
day           True
time          True
size          True
tip_pct       True
dtype: bool

# 10.3 Apply: universal "split application union" specification

In [71]:
def top(df, n=5, column="tip_pct"):
    return df.sort_values(column, ascending=False)[:n]

In [72]:
top(tips, n=6)

     total_bill   tip smoker  day    time  size   tip_pct
172        7.25  5.15    Yes  Sun  Dinner     2  0.710345
178        9.60  4.00    Yes  Sun  Dinner     2  0.416667
67         3.07  1.00    Yes  Sat  Dinner     1  0.325733
232       11.61  3.39     No  Sat  Dinner     2  0.291990
183       23.17  6.50    Yes  Sun  Dinner     4  0.280535
109       14.31  4.00    Yes  Sat  Dinner     2  0.279525

In [73]:
tips.groupby("smoker").apply(top)

/tmp/ipykernel_4792/2530541573.py:1: FutureWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  tips.groupby("smoker").apply(top)

            total_bill   tip smoker   day    time  size   tip_pct
smoker
No     232       11.61  3.39     No   Sat  Dinner     2  0.291990
       149        7.51  2.00     No  Thur   Lunch     2  0.266312
       51        10.29  2.60     No   Sun  Dinner     2  0.252672
       185       20.69  5.00     No   Sun  Dinner     5  0.241663
       88        24.71  5.85     No  Thur   Lunch     2  0.236746
Yes    172        7.25  5.15    Yes   Sun  Dinner     2  0.710345
       178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
       67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
       183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
       109       14.31  4.00    Yes   Sat  Dinner     2  0.279525

In [74]:
tips.groupby(["smoker", "day"]).apply(top, n=1, column="total_bill")

/tmp/ipykernel_4792/643835440.py:1: FutureWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  tips.groupby(["smoker", "day"]).apply(top, n=1, column="total_bill")

                 total_bill    tip smoker   day    time  size   tip_pct
smoker day
No     Fri  94        22.75   3.25     No   Fri  Dinner     2  0.142857
       Sat  212       48.33   9.00     No   Sat  Dinner     4  0.186220
       Sun  156       48.17   5.00     No   Sun  Dinner     6  0.103799
       Thur 142       41.19   5.00     No  Thur   Lunch     5  0.121389
Yes    Fri  95        40.17   4.73    Yes   Fri  Dinner     4  0.117750
       Sat  170       50.81  10.00    Yes   Sat  Dinner     3  0.196812
       Sun  182       45.35   3.50    Yes   Sun  Dinner     3  0.077178
       Thur 197       43.11   5.00    Yes  Thur   Lunch     4  0.115982

In [75]:
result = tips.groupby("smoker")["tip_pct"].describe()

In [76]:
result

,count,mean,std,min,25%,50%,75%,max
smoker,,,,,,,,
No,151.0,0.159328,0.039910,0.056797,0.136906,0.155625,0.185014,0.291990
Yes,93.0,0.163196,0.085119,0.035638,0.106771,0.153846,0.195059,0.710345

In [77]:
result.unstack("smoker")

       smoker
count  No        151.000000
       Yes        93.000000
mean   No          0.159328
       Yes         0.163196
std    No          0.039910
       Yes         0.085119
min    No          0.056797
       Yes         0.035638
25%    No          0.136906
       Yes         0.106771
50%    No          0.155625
       Yes         0.153846
75%    No          0.185014
       Yes         0.195059
max    No          0.291990
       Yes         0.710345
dtype: float64

In [78]:
def f(group):
    return group.describe()

In [79]:
grouped.apply(f)

/tmp/ipykernel_4792/833689054.py:1: FutureWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  grouped.apply(f)

                   total_bill       tip  size   tip_pct
day  smoker
Fri  No     count    4.000000  4.000000  4.00  4.000000
            mean    18.420000  2.812500  2.25  0.151650
            std      5.059282  0.898494  0.50  0.028123
            min     12.460000  1.500000  2.00  0.120385
            25%     15.100000  2.625000  2.00  0.137239
...                       ...       ...   ...       ...
Thur Yes    min     10.340000  2.000000  2.00  0.090014
            25%     13.510000  2.000000  2.00  0.148038
            50%     16.470000  2.560000  2.00  0.153846
            75%     19.810000  4.000000  2.00  0.194837
            max     43.110000  5.000000  4.00  0.241255

[64 rows x 4 columns]

# 10.3.1 disable grouping key

In [80]:
tips.groupby("smoker", group_keys=False).apply(top)

/tmp/ipykernel_4792/3851957478.py:1: FutureWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  tips.groupby("smoker", group_keys=False).apply(top)

     total_bill   tip smoker   day    time  size   tip_pct
232       11.61  3.39     No   Sat  Dinner     2  0.291990
149        7.51  2.00     No  Thur   Lunch     2  0.266312
51        10.29  2.60     No   Sun  Dinner     2  0.252672
185       20.69  5.00     No   Sun  Dinner     5  0.241663
88        24.71  5.85     No  Thur   Lunch     2  0.236746
172        7.25  5.15    Yes   Sun  Dinner     2  0.710345
178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
109       14.31  4.00    Yes   Sat  Dinner     2  0.279525

# 10.3.2 quantile and bucket analysis

In [81]:
frame = pd.DataFrame({"data1": np.random.standard_normal(1000),
                      "data2": np.random.standard_normal(1000)})

In [82]:
frame.head()

      data1     data2
0  0.606092 -1.243275
1  1.784000  0.563597
2 -0.400378  0.724765
3 -1.577464  2.863030
4  0.080873  2.985438

In [83]:
quartiles = pd.cut(frame["data1"], 4)

In [84]:
quartiles.head(10)

0      (0.134, 1.675]
1      (1.675, 3.216]
2     (-1.406, 0.134]
3    (-2.953, -1.406]
4     (-1.406, 0.134]
5     (-1.406, 0.134]
6      (1.675, 3.216]
7      (0.134, 1.675]
8      (0.134, 1.675]
9     (-1.406, 0.134]
Name: data1, dtype: category
Categories (4, interval[float64, right]): [(-2.953, -1.406] < (-1.406, 0.134] < (0.134, 1.675] < (1.675, 3.216]]

In [85]:
def get_stats(group):
    return pd.DataFrame(
        {"min": group.min(), "max": group.max(),
         "count": group.count(), "mead": group.mean()}
    )

In [86]:
grouped = frame.groupby(quartiles)

/tmp/ipykernel_4792/4041437760.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  grouped = frame.groupby(quartiles)

In [87]:
grouped.apply(get_stats)

                             min       max  count      mead
data1
(-2.953, -1.406] data1 -2.947277 -1.407376     83 -1.811034
                 data2 -2.417056  2.943644     83 -0.143506
(-1.406, 0.134]  data1 -1.398729  0.126497    466 -0.485288
                 data2 -2.670486  3.212958    466  0.054307
(0.134, 1.675]   data1  0.134658  1.659336    404  0.747298
                 data2 -3.002540  2.745454    404 -0.006489
(1.675, 3.216]   data1  1.683159  3.216217     47  2.172254
                 data2 -2.480757  2.942813     47  0.051862

In [88]:
grouped.agg(["min", "max", "count", "mean"])

                     data1                               data2            \
                       min       max count      mean       min       max
data1
(-2.953, -1.406] -2.947277 -1.407376    83 -1.811034 -2.417056  2.943644
(-1.406, 0.134]  -1.398729  0.126497   466 -0.485288 -2.670486  3.212958
(0.134, 1.675]    0.134658  1.659336   404  0.747298 -3.002540  2.745454
(1.675, 3.216]    1.683159  3.216217    47  2.172254 -2.480757  2.942813


                 count      mean
data1
(-2.953, -1.406]    83 -0.143506
(-1.406, 0.134]    466  0.054307
(0.134, 1.675]     404 -0.006489
(1.675, 3.216]      47  0.051862

In [89]:
quartiles_samp = pd.qcut(frame["data1"], 4, labels=False)

In [90]:
quartiles_samp.head()

0    2
1    3
2    1
3    0
4    2
Name: data1, dtype: int64

In [91]:
grouped = frame.groupby(quartiles_samp)

In [92]:
grouped.apply(get_stats)

                  min       max  count      mead
data1
0     data1 -2.947277 -0.597540    250 -1.229083
      data2 -2.417056  2.943644    250 -0.056771
1     data1 -0.597228 -0.001936    250 -0.289454
      data2 -2.670486  3.212958    250  0.076532
2     data1  0.002664  0.653797    250  0.333225
      data2 -2.388703  2.985438    250  0.014429
3     data1  0.659202  3.216217    250  1.295488
      data2 -3.002540  2.942813    250  0.018658

# 10.3.3 example: fill in missing values with values from the specified group

In [93]:
s = pd.Series(np.random.standard_normal(6))

In [94]:
s[::2] = np.nan

In [95]:
s

0         NaN
1    0.271985
2         NaN
3    1.042020
4         NaN
5    2.141694
dtype: float64

In [96]:
s.fillna(s.mean())

0    1.151900
1    0.271985
2    1.151900
3    1.042020
4    1.151900
5    2.141694
dtype: float64

In [97]:
states = ["Ohio", "New York", "Vermont", "Florida",
          "Oregon", "Nevada", "California", "Idaho"]

In [98]:
group_key = ["East", "East", "East", "East",
             "West", "West", "West", "West"]

In [99]:
data = pd.Series(np.random.standard_normal(8), index=states)

In [100]:
data

Ohio         -0.028539
New York     -0.794903
Vermont       1.261046
Florida       0.130556
Oregon        0.604838
Nevada       -0.408875
California   -0.471475
Idaho         0.558759
dtype: float64

In [101]:
data[["Vermont", "Nevada", "Idaho"]] = np.nan

In [102]:
data

Ohio         -0.028539
New York     -0.794903
Vermont            NaN
Florida       0.130556
Oregon        0.604838
Nevada             NaN
California   -0.471475
Idaho              NaN
dtype: float64

In [103]:
data.groupby(group_key).size()

East    4
West    4
dtype: int64

In [104]:
data.groupby(group_key).count()

East    3
West    2
dtype: int64

In [105]:
data.groupby(group_key).mean()

East   -0.230962
West    0.066682
dtype: float64

In [106]:
def fill_mean(group):
    return group.fillna(group.mean())

In [107]:
data.groupby(group_key).apply(fill_mean)

East  Ohio         -0.028539
      New York     -0.794903
      Vermont      -0.230962
      Florida       0.130556
West  Oregon        0.604838
      Nevada        0.066682
      California   -0.471475
      Idaho         0.066682
dtype: float64

In [108]:
fill_values = {"East": 0.5, "West": -1}

In [109]:
def fill_func(group):
    return group.fillna(fill_values[group.name])

In [110]:
data.groupby(group_key).apply(fill_func)

East  Ohio         -0.028539
      New York     -0.794903
      Vermont       0.500000
      Florida       0.130556
West  Oregon        0.604838
      Nevada       -1.000000
      California   -0.471475
      Idaho        -1.000000
dtype: float64

# 10.3.4 example: random sampling and sorting

In [125]:
suits = ["H", "S", "C", "D"] # heart spade club diamond
card_val = (list(range(1, 11)) + [10] * 3) * 4
base_names = ["A"] + list(range(2, 11)) + ["J", "K", "Q"]
cards = []
for suit in suits:
    cards.extend(str(num) + suit for num in base_names)

deck = pd.Series(card_val, index=cards)

In [130]:
deck.head(13)

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
KH     10
QH     10
dtype: int64

In [131]:
def draw(deck, n=5):
    return deck.sample(n)

In [132]:
draw(deck)

8H     8
QC    10
JH    10
3D     3
9D     9
dtype: int64

In [133]:
def get_suit(card):
    # The last letter is the color
    return card[-1]

In [134]:
deck.groupby(get_suit).apply(draw, n=2)

C  QC    10
   8C     8
D  4D     4
   9D     9
H  9H     9
   KH    10
S  KS    10
   6S     6
dtype: int64

In [135]:
deck.groupby(get_suit, group_keys=False).apply(draw, n=2)

8C     8
JC    10
QD    10
KD    10
AH     1
QH    10
9S     9
3S     3
dtype: int64

# 10.3.5 example: group weighted average and correlation coefficient